
# 대입 연산자 심화
a = b = c = 1
name, age, address = "홍길동",20,"서울"  # 갯수 일치 중요!
print(name,age,address)

# 갯수 달라도 됨. packing
v1, *v2 = [10,20,30]  # 값은 1개인데 변수는 2개
print(v1,v2)  # 10 [20, 30]

v1, *v2 = (10,20,30, 54, 5, 6)
print(v1,v2)  # 10 [20, 30, 54, 5, 6]

*v1, v2, v3 = (10,20,30, 54, 5, 6)  # 값은 1개인데 변수는 2개
print(v1,v2,v3)  # [10, 20, 30, 54] 5 6

v1, *v2 = {10,20,30}
print(v1,v2)  # 10 [20, 30]

# dict는 key값이 저장된다.
x, y = {'x':'홍길동', 'y':'이순신'}
print(x, y)  # x y

v1,*v2={'a':100,'b':200 ,'c':300}
print(v1,v2)  # a ['b', 'c']